Tekla Open API Reference for Tekla Structures 2025
ReportTemplateElement.Template Property
 The template.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TemplateInfo Template { get; set; }
Public Property Template As TemplateInfo
	Get
	Set
Property Value
Type: TemplateInfo
See Also
Reference
ReportTemplateElement Class
Tekla.Structures.Drawing Namespace